Чистая/src/Documents/РеализацияТоваровИУслуг/РеализацияТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Чистая/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
</mdclass:Enum>

Чистая/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
</mdclass:Catalog>

Чистая/src/Documents/РеализацияТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Функция СуммаПоСтроке(Строка)
	
	//Создать клиентскую функцию СуммаПоСтроке(Строка),
	//которая возвращает сумму с учетом количества, цены и скидки
	СтрСумма = Строка.Количество * Строка.Цена * ((100 - Строка.Скидка) / 100);
	Возврат СтрСумма;
		
КонецФункции

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.Цена = ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, ЭтотОбъект.Объект.Дата);
	ИзмененнаяСтрока.Скидка = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.Номенклатура, ЭтотОбъект.Объект.Дата);
	
	//СкидкаНом = ЦеныВызовСервера.СкидкаНаДату(ИзмененнаяСтрока.Номенклатура, ЭтотОбъект.Объект.Дата);
	//НоменклГр = ВозвратНоменклатурнойГруппы(ИзмененнаяСтрока.Номенклатура);
	//
	//Если НоменклГр <> Неопределено Тогда
	//	СкидкаГруппа = ЦеныВызовСервера.СкидкаНаДату(НоменклГр, ЭтотОбъект.Объект.Дата);
	//Иначе
	//	СкидкаГруппа = 0;
	//КонецЕсли;
	//	
	//ИзмененнаяСтрока.Скидка = СкидкаНом + СкидкаГруппа;
	

	ИзмененнаяСтрока.СтавкаНДС = ВозвратНДС(ИзмененнаяСтрока.Номенклатура);
	ПриИзмененииЦены(ИзмененнаяСтрока);
	ПриИзмененииСкидки(ИзмененнаяСтрока);
	ПриИзмененииСтавкиНДС(ИзмененнаяСтрока);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока)
		
	ИзмененнаяСтрока.Сумма = СуммаПоСтроке(ИзмененнаяСтрока);
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСкидки(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.Сумма = СуммаПоСтроке(ИзмененнаяСтрока);
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.Сумма = СуммаПоСтроке(ИзмененнаяСтрока);
	ПриИзмененииСуммы(ИзмененнаяСтрока);
	
КонецПроцедуры 


&НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока)
	
	Если ИзмененнаяСтрока.Количество > 0 Тогда
		ИзмененнаяСтрока.Скидка = 100 * (1 - ИзмененнаяСтрока.Сумма / ИзмененнаяСтрока.Количество / ИзмененнаяСтрока.Цена); 
	КонецЕсли;
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)
	
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ВозвратНДС(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.СтавкаНДС КАК НДС
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка = &Номенклатура";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НДС;
	Иначе
		Возврат Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;
	
	
КонецФункции


Функция ВозвратНоменклатурнойГруппы(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Ссылка = &Номенклатура";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.НоменклатурнаяГруппа;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	
КонецФункции


&НаКлиенте
Процедура ТоварыИУслугиНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииНоменклатуры(ТекущиеДанныеТаблицы);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииКоличества(ТекущиеДанныеТаблицы);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиСтавкаНДСПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииСтавкиНДС(ТекущиеДанныеТаблицы);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииСкидки(ТекущиеДанныеТаблицы);
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыИУслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииЦены(ТекущиеДанныеТаблицы);
	
КонецПроцедуры 

&НаКлиенте
Процедура ТоварыИУслугиСуммаПриИзменении(Элемент)
	
	ТекущиеДанныеТаблицы = Элементы.ТоварыИУслуги.ТекущиеДанные;
	Если ТекущиеДанныеТаблицы = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПриИзмененииСуммы(ТекущиеДанныеТаблицы); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиПриИзменении(Элемент)
	
	Объект.Сумма = Объект.ТоварыИУслуги.Итог("Сумма") + Объект.ТоварыИУслуги.Итог("СуммаНДС");
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда) 
	
	Параметр = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора",Параметр, Элементы.ТоварыИУслуги);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", ВыбранноеЗначение);
	НайденныеСтроки = Объект.ТоварыИУслуги.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		Сообщить(СтрШаблон("%1 уже есть в списке.", ВыбранноеЗначение));
		Возврат
	Иначе
		
		
		СтрокаТаблицы = Объект.ТоварыИУслуги.Добавить();
		СтрокаТаблицы.Номенклатура = ВыбранноеЗначение;
		ПриИзмененииНоменклатуры(СтрокаТаблицы);
	КонецЕсли; 
	
КонецПроцедуры
